fabrika/src/InformationRegisters/НастройкаПодключенийКБазам/НастройкаПодключенийКБазам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаПодключенийКБазам</name>
  <resources>
    <name>СтрокаПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерверCOMОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипПлатформы1С</name>
    <comment>Тип платформы1 С</comment>
    <type>
      <types>EnumRef.ТипПлатформы1С</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипОрганизации</name>
    <type>
      <types>EnumRef.ТипОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСоединения</name>
    <comment>Тип соединения</comment>
    <type>
      <types>EnumRef.ТипСоединения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fabrika/src/Enums/ТипСоединения/ТипСоединения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипСоединения</name>
  <comment>Тип соединения</comment>
  <enumValues>
    <name>Com</name>
    <comment>Com</comment>
  </enumValues>
  <enumValues>
    <name>Http</name>
    <comment>Http</comment>
  </enumValues>
</mdclass:Enum>

fabrika/src/InformationRegisters/НастройкаПодключенийКБазам/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    УстановитьВидимостьЭлементов();    
КонецПроцедуры



#КонецОбласти 

#Область ВспомогательныеПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
    
    Http = Запись.ТипСоединения = Перечисления.ТипСоединения.Http;
    Заголовок1 = ?(Http, "Путь до сервиса", "Строка подключения");
    Заголовок2 = ?(Http, "Http сервер", "Сервер COM Объекта");
    
    Элементы.СтрокаПодключения.Заголовок = Заголовок1;
    Элементы.СерверCOMОбъекта.Заголовок = Заголовок2;
    Элементы.ТипПлатформы1С.Видимость = НЕ Http;
    
КонецПроцедуры

&НаКлиенте
Процедура ТипСоединенияПриИзменении(Элемент)
    УстановитьВидимостьЭлементов();
КонецПроцедуры


#КонецОбласти
